'''
Напишите рекурсивную функцию tri_2(n), которая печатает 2 треугольника:
Например, для n = 5:
*****
****
**
*
**
***
****
*****

'''

def tri_2(n):
    print('*'* n)
    n -= 1
    if n > 0:
        tri_2(n)
    elif n==0:
        return
    print('*'* (n+1))

tri_2(5)
